Revit 2027 API
ExternalResourceBrowserData.IsValidFolderName Method
 Checks whether the folder name is valid.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsValidFolderName(
	string folderName
)
Public Function IsValidFolderName (
	folderName As String
) As Boolean
public:
bool IsValidFolderName(
	String^ folderName
)
member IsValidFolderName :
        folderName : string -> bool
Parameters
folderName String
 The folder name to check.
Return Value
Boolean
 True if the name is a valid folder name, false otherwise.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ExternalResourceBrowserData Class
Autodesk.Revit.DB Namespace